In [2]:
import pandas as pd
import random
import numpy as np

1. ¿Qué diferencia hay entre una Serie y un DataFrame?
Una Serie es un objeto unidimensional similar a un array o una lista que puede contener un tipo de datos 
Un DataFrame es una estructura de datos bidimensional que se asemeja a una tabla o hoja de cálculo con filas y columnas etiquetadas.
Está compuesto por una o más Series que comparten el mismo índice

2. Momento de trabajar con Series. Contesta a las siguientes preguntas:
Crea dos listas:
- Una que se llame "valores" que tenga 7 números aleatorios.
- Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

In [7]:
valores = random.sample(range(1, 15), 7)
valores

[14, 6, 13, 5, 9, 8, 4]

In [8]:
indices = ['Lunes', 'Martes', 'Miércoles', 'Jueves', 'Viernes', 'Sábado', 'Domingo']
indices

['Lunes', 'Martes', 'Miércoles', 'Jueves', 'Viernes', 'Sábado', 'Domingo']

A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

In [9]:
serie_lista1 = pd.Series(valores, indices)
serie_lista1

Lunes        14
Martes        6
Miércoles    13
Jueves        5
Viernes       9
Sábado        8
Domingo       4
dtype: int64

A partir de las dos listas anteriores crea un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez.

In [11]:
diccionario = {}
for dia, valor in zip(indices, valores):
    diccionario[dia] = valor

diccionario

{'Lunes': 14,
 'Martes': 6,
 'Miércoles': 13,
 'Jueves': 5,
 'Viernes': 9,
 'Sábado': 8,
 'Domingo': 4}

Crea una Serie con el diccionario creado en el punto anterior.

In [13]:
serie_diccionario1 = pd.Series(diccionario)
serie_diccionario1

Lunes        14
Martes        6
Miércoles    13
Jueves        5
Viernes       9
Sábado        8
Domingo       4
dtype: int64

¿Qué forma tiene esta última Serie?

In [14]:
serie_diccionario1.shape

(7,)

¿Qué tipo de datos tiene?

In [15]:
serie_diccionario1.dtypes

dtype('int64')

¿Qué tamaño tiene?

In [16]:
serie_diccionario1.size

7

¿Cuáles son los índices de la Serie?

In [17]:
serie_diccionario1.index

Index(['Lunes', 'Martes', 'Miércoles', 'Jueves', 'Viernes', 'Sábado',
       'Domingo'],
      dtype='object')

¿Y los values?

In [18]:
serie_diccionario1.values

array([14,  6, 13,  5,  9,  8,  4])

Extrae el valor para el índice "lunes"

In [24]:
serie_diccionario1[0]

14

In [25]:
serie_diccionario1["Lunes"]

14

Extrae el valor para el índice "lunes", "martes" y "miércoles".

In [26]:
serie_diccionario1[["Lunes","Martes","Miércoles"]]

Lunes        14
Martes        6
Miércoles    13
dtype: int64

Extrae el valor para el índice "lunes" y "domingo".

In [28]:
serie_diccionario1[["Lunes","Domingo"]]

Lunes      14
Domingo     4
dtype: int64

3.Es el turno de los DataFrames
- Crea un array de dos dimensiones con 4 filas y 3 columnas.

In [3]:
array_1 = np.random.randint(0,50,(4,3))
array_1

array([[ 1, 27, 39],
       [23, 22, 41],
       [ 4, 17, 29],
       [15, 22, 28]])

Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

In [4]:
dataframe_array = pd.DataFrame(array_1, columns=['España', 'Francia', 'Italia'])
dataframe_array

   España  Francia  Italia
0       1       27      39
1      23       22      41
2       4       17      29
3      15       22      28

Descarga el archivo "medallas" y carga el DataFrame.

In [4]:
df_medallas = pd.read_csv("medallas.csv", index_col=0)
df_medallas.head(5)

            País   Oro  Plata  Bronce
1          China  1473    994     720
2          Japón  1032   1037     985
3  Corea del Sur   745    663     827
4           Irán   179    181     197
5     Kazajistán   155    158     224

Usando el loc extrae todas las columnas de la fila de Tailandia.

In [17]:
df = df_medallas.set_index('País')

tailandia = df.loc['Tailandia']
tailandia

Unnamed: 0      7
Oro           132
Plata         175
Bronce        278
Name: Tailandia, dtype: int64

Usando el loc extrae todas las columnas de China e Irán.

In [16]:
china_iran = df.loc[['China', 'Irán']]
china_iran

       Unnamed: 0   Oro  Plata  Bronce
País
China           1  1473    994     720
Irán            4   179    181     197

Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

In [15]:
columnas_china_iran = df.loc[['China', 'Irán'], ['Oro', 'Plata', 'Bronce']]
columnas_china_iran

        Oro  Plata  Bronce
País
China  1473    994     720
Irán    179    181     197

Usando el iloc extrae la información de la India. Devolved todas las columnas.

In [21]:
india = df.iloc[df.index.get_loc('India')]
india

Unnamed: 0      6
Oro           154
Plata         202
Bronce        315
Name: India, dtype: int64

Usando el iloc extrae todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

In [23]:
paises_impares = df.iloc[1::2]
paises_impares

                 Unnamed: 0   Oro  Plata  Bronce
País
Japón                     2  1032   1037     985
Irán                      4   179    181     197
India                     6   154    202     315
Indonesia                 8   112    131     240
Corea del Norte          10    91    120     235

Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".

In [25]:
impares = df.iloc[1::2][['Oro', 'Plata', 'Bronce']]
impares

                  Oro  Plata  Bronce
País
Japón            1032   1037     985
Irán              179    181     197
India             154    202     315
Indonesia         112    131     240
Corea del Norte    91    120     235

Contesta a las siguientes preguntas:
¿Qué país consiguió más de 200 medallas de oro?

¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

Crea una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.